Here is the content added in a clear and organized way for your `README.md` file:

---

## ðŸ’» 2.7.3 Syntax Checker â€“ Verify Windows PC IP Configuration

To **check IP settings** on a Windows PC, you can use the **Command Prompt**.

### âœ… Command:

```bash
ipconfig
```

### ðŸ“„ Sample Output:

```
C:\>ipconfig

Windows IP Configuration

Ethernet adapter Local Area Connection:

   Connection-specific DNS Suffix  . : cisco.com
   Link-local IPv6 Address . . . . . : fe80::b0ef:ca42:af2c:c6c7%16
   IPv4 Address. . . . . . . . . . . : 192.168.1.10
   Subnet Mask . . . . . . . . . . . : 255.255.255.0
   Default Gateway . . . . . . . . . : 192.168.1.1
```

This output confirms the IPv4 address, subnet mask, and default gateway assigned to the PCâ€”either manually or via DHCP.

---
Here's the explanation written in clear markdown format for your `README.md` file:

---




## ðŸ”§ 2.7.4 Switch Virtual Interface (SVI) Configuration

To allow **remote management of a switch**, an **IP address must be assigned to a Switch Virtual Interface (SVI)**. An SVI does not refer to a physical port but a **virtual interface**, typically `VLAN 1`.

### ðŸ“˜ Steps to Configure SVI on a Switch:

1. Enter global configuration mode.
2. Enter VLAN 1 interface configuration.
3. Assign an IPv4 address and subnet mask.
4. Enable the interface using `no shutdown`.
5. (Optional but common) Set the **default gateway** for remote communication.

### âœ… Example Configuration:

```bash
Sw-Floor-1# configure terminal
Sw-Floor-1(config)# interface vlan 1
Sw-Floor-1(config-if)# ip address 192.168.1.20 255.255.255.0
Sw-Floor-1(config-if)# no shutdown
Sw-Floor-1(config-if)# exit
Sw-Floor-1(config)# ip default-gateway 192.168.1.1
```

### ðŸ’¡ Notes:

* `interface vlan 1` creates a virtual interface.
* `ip address` assigns the IPv4 address to the SVI.
* `no shutdown` activates the interface.
* `ip default-gateway` sets the path for the switch to communicate outside its subnet (i.e., to a router).

This setup allows the switch to be managed over the network just like any other IP-enabled device.

---

Hereâ€™s how you can write section **2.7.5** in your `README.md` file using a clear and structured format:

---

## âš™ï¸ 2.7.5 Syntax Checker - Configure a Switch Virtual Interface

This section demonstrates how to configure a **Switch Virtual Interface (SVI)** on VLAN 1 to enable network communication and remote management.

### ðŸ› ï¸ Step-by-Step Configuration:

1. **Enter interface configuration mode for VLAN 1**:

   ```bash
   Switch(config)#interface vlan 1
   ```

2. **Configure the IPv4 address and subnet mask**:

   ```bash
   Switch(config-if)#ip address 192.168.1.20 255.255.255.0
   ```

3. **Enable the interface**:

   ```bash
   Switch(config-if)#no shutdown
   %LINK-5-CHANGED: Interface Vlan1, changed state to up
   ```

### âœ… Result:

You have successfully configured the switch virtual interface for **VLAN 1**. This allows the switch to participate in the network and be accessed remotely for management.

---






Great! Below is the updated `README.md` content **with exact commands** and **where they are fired from**, clearly marked for **Switch (S1/S2)** and **PC (PC1/PC2)**:

---

```markdown
# ðŸ“˜ 2.7.6 - Implement Basic Connectivity

This file contains **all commands** and **manual configuration steps** for setting up basic connectivity between switches and PCs in Cisco Packet Tracer.

---

## ðŸ“ Project Structure

```

2.7.6-Implement-Basic-Connectivity/
â”‚
â”œâ”€â”€ Switches/
â”‚   â”œâ”€â”€ S1/
â”‚   â”‚   â”œâ”€â”€ Basic Config
â”‚   â”‚   â”œâ”€â”€ VLAN 1 Interface Setup
â”‚   â”‚   â””â”€â”€ IP Verification
â”‚   â””â”€â”€ S2/
â”‚       â”œâ”€â”€ Basic Config
â”‚       â”œâ”€â”€ VLAN 1 Interface Setup
â”‚       â””â”€â”€ IP Verification
â”‚
â”œâ”€â”€ PCs/
â”‚   â”œâ”€â”€ PC1/
â”‚   â”‚   â””â”€â”€ Manual IP + Ping Test
â”‚   â””â”€â”€ PC2/
â”‚       â””â”€â”€ Manual IP + Ping Test

````

---

## ðŸ”Œ Switch Configuration (S1 and S2)

> ðŸ’» Fired from: Switch CLI (S1 or S2 Terminal)

### âœ… Step 1: Basic Configuration

```bash
Switch> enable
Switch# configure terminal
Switch(config)# hostname S1          # Use S2 for second switch
S1(config)# line console 0
S1(config-line)# password cisco
S1(config-line)# login
S1(config-line)# exit
S1(config)# enable secret class
S1(config)# banner motd #Unauthorized access is prohibited#
S1(config)# end
S1# write memory
````

### âœ… Step 2: VLAN Interface Setup

```bash
S1# configure terminal
S1(config)# interface vlan 1
S1(config-if)# ip address 192.168.1.253 255.255.255.0
S1(config-if)# no shutdown
S1(config-if)# exit
S1(config)# end
S1# write memory
```

> ðŸ” Repeat same steps for S2 with IP: `192.168.1.254`

---

## ðŸ’» PC Configuration

> ðŸ“ Fired from: GUI on PC (Desktop > IP Configuration)

### âœ… PC1:

```plaintext
IP Address:      192.168.1.1
Subnet Mask:     255.255.255.0
Default Gateway: [Leave Blank]
```

### âœ… PC2:

```plaintext
IP Address:      192.168.1.2
Subnet Mask:     255.255.255.0
Default Gateway: [Leave Blank]
```

---

## ðŸ” IP Address Verification

> ðŸ’» Fired from: **Windows Command Prompt on PC1 or PC2**

```bash
C:\> ipconfig
```

You should see:

```plaintext
IPv4 Address. . . . . . . . . . . : 192.168.1.1
Subnet Mask . . . . . . . . . . . : 255.255.255.0
Default Gateway . . . . . . . . . : 
```

---

## ðŸ§ª Ping Tests

> ðŸ§ª Fired from: **PC1 Command Prompt**

```bash
ping 192.168.1.2       # Ping PC2
ping 192.168.1.253     # Ping Switch S1
ping 192.168.1.254     # Ping Switch S2
```

> ðŸ§ª Fired from: **PC2 Command Prompt**

```bash
ping 192.168.1.1       # Ping PC1
```

---

## ðŸ“Š Show Commands on Switch

> ðŸ”§ Fired from: Switch CLI (S1 or S2)

```bash
S1# show ip interface brief
S1# show running-config
```

---

âœ… This confirms successful manual IP configuration and device connectivity in a basic LAN setup.

```

---

Would you like me to export this as a `.md` file for your project folder?
```

